
hebrew_keywords = [
    "מס משימה",
    "מס ניידת",
    "תאריך",
    "סוג תעודה",
    "גיל",
    "שם האב",
    "מייל",
    "מין",
    "תאריך לידה",
    "קופת חולים",
    "כתובת",
    "שם מלא",
    "טלפון",
    "ישוב",
    "מקום האירוע",
    "עיר",
    "המקרה שנמצא",
    "תלונה עיקרית",
    "סטטוס המטופל",
    "רקע רפואי",
    "רגישויות",
    "תרופות קבועות"
]

case_codes = {
    "דום לב": "10",
    "חשד לבצקת ריאות": "11",
    "דפיקות לב": "12",
    "הפרעות קצב": "13",
    "חשד לאוטם בשריר הלב": "14",
    "יתר לחץ דם": "15",
    "חשד לתסמונת כלילית חריפה": "16",
    "בעיות קרדיאליות אחרות": "17",
    "דום נשימה": "30",
    "חשד לדלקת ריאות": "31",
    "חשד להתקף אסטמה": "32",
    "חנק/ אספירציה": "33",
    "קוצר נשימה קל": "34",
    "קוצר נשימה משמעותי": "35",
    "בעיות גניקולוגיות": "50",
    "יולדת - הפלה": "51",
    "יולדת - צירים": "52",
    "יולדת - קבלת לידה": "53",
    "חוסר הכרה": "60",
    "שינוי במצב הכרה": "61",
    "חשד לאירוע מוחי": "62",
    "פרכוסים/ לאחר פרכוסים": "63",
    "לאחר עילפון": "64",
    "לחץ דם נמוך": "65",
    "היפוגלקמיה": "66",
    "היפרגליקמיה": "67",
    "תגובה אלרגית / תגובת יתר": "68",
    "אנאפילקסיס": "69",
    "חשד למצב חירום בטני": "70",
    "התייבשות": "71",
    "חש ברע": "72",
    "סחרחורות/בלבול": "73",
    "חולשה": "74",
    "חום גבוה": "75",
    "דימום - לא טראומתי": "76",
    "בדיקות דם לא תקינות": "77",
    "היפר וונטילצייה (חרדה)": "78",
    "כאבי גב": "90",
    "כאבים בגוף": "91",
    "כאבים בחזה - מקור שאינו לבבי": "92",
    "נפגע חרדה/חוסן": "100",
    "הפרעות נפשיות": "101",
    "בעיות רפואיות אחרות": "102",
    "פציעה קלה": "201",
    "פציעה קשה": "202",
    "פציעה רב מערכתית": "203",
    "פגיעת ראש": "204",
    "פגיעת חזה": "205",
    "פגיעת בטן": "206",
    "חבלת ראש": "207",
    "חבלת עמ\"ש - עמש\"צ": "208",
    "חבלת אגן": "209",
    "חבלה בגפיים": "210",
    "תאונת דרכים": "220",
    "תאונת עבודה": "221",
    "ירייה": "222",
    "דקירה": "223",
    "חשד לנסיון אובדני": "224",
    "מינון יתר - אלכוהול": "225",
    "מינון יתר - תרופות / סמים": "226",
    "חשד להרעלה": "227",
    "שאיפת עשן - חומרים רעילים": "228",
    "כוויה": "229",
    "מכת חום - היפרטרמיה": "231",
    "מכת קור - היפוטרמיה": "232",
    "טביעה": "233",
    "התחשמלות": "234",
    "פגיעת בעל חיים": "235",
    "העברה ממתקן למתקן רפואי": "300",
    "העברת חולה/נפגע": "301",
    "אבטחת אירוע": "302",
    "משימה מנהלתית": "303",
    "תרגיל": "304",
    "קביעת מוות": "305",
    "סיוע סיעודי לחולה בבית": "306",
    "סיוע לצוות רפואי במקום": "307",
    "ארוע ללא נפגעים": "308",
    "ביטול על ידי משטרה כבה": "309",
    "המטופל עזב את המקום": "310",
    "לא נמצא כתובת": "311",
    "ביטול על ידי מוקד": "312",
    "ביטול במקום אין צורך בנוספים": "313",
    "ביטול עצמי לאחר יציאה": "314",
    "סירוב טיפול ופינוי": "315",
    "סירוב פינוי": "316"


}

json_format ={
    "type": "object",
    "required": ["מס משימה", "מס ניידת", "תאריך", "פרטי המטופל", "פרטי האירוע", "פירוט המקרה", "מדדים", "טיפולים", "טיפול תרופתי", "פינוי"],
    "properties": {
        "מס משימה": {"type": "string"},
        "מס ניידת": {"type": "string"},
        "תאריך": {"type": "string"},
        "פרטי המטופל": {
        "type": "object",
        "required": ["סוג תעודה", "גיל", "מין"],
        "properties": {
            "סוג תעודה": {"type": "string"},
            "גיל": {"type": "integer"},
            "שם האב": {"type": "string"},
            "מייל": {"type": "string"},
            "מין": {"type": "string"},
            "ת. לידה": {"type": "string"},
            "קופת חולים": {"type": "string"},
            "כתובת": {"type": "string"},
            "שם מלא": {"type": "string"},
            "טלפון": {"type": "string"},
            "ישוב": {"type": "string"}
        }
        },
        "פרטי האירוע": {
        "type": "object",
        "required": ["כתובת", "מקום האירוע", "עיר"],
        "properties": {
            "כתובת": {"type": "string"},
            "מקום האירוע": {"type": "string"},
            "עיר": {"type": "string"}
        }
        },
        "פירוט המקרה": {
        "type": "object",
        "required": ["המקרה שנמצא", "תלונה עיקרית", "אנמנזה", "סטטוס המטופל"],
        "properties": {
            "המקרה שנמצא": {"type": "string"},
            "תלונה עיקרית": {"type": "string"},
            "אנמנזה": {"type": "string"},
            "סטטוס המטופל": {"type": "string"},
            "רקע רפואי": {"type": "string"},
            "רגישויות": {"type": "string"},
            "תרופות קבועות": {"type": "string"},
            "קוד אירוע": {"type": "string"}
        }
        },
        "מדדים": {
        "type": "array",
        "items": {
            "type": "object",
            "required": ["זמן בדיקה", "הכרה", "נשימה"],
            "properties": {
            "זמן בדיקה": { "type": "string" },
                "הכרה": { "type": "string" },
                "נשימה": { "type": "string" },
                "קצב נשימה": { "type": "string" },
                "דופק": { "type": "string" },
                "דופק לדקה": { "type": "string" },
                "מצב העור": { "type": "string" },
                "סרגל כאב": { "type": "string" },
                "האזנה": { "type": "string" },
                "ריאה ימין": { "type": "string" },
                "ריאה שמאל": { "type": "string" },
                "ETCO2": { "type": "string" },
                "קצב לב": { "type": "string" },
                "אישונים": { "type": "string" },
                "ציון גלזגו": { "type": "string" }       
                }
            }
        }
        },
        "טיפולים": {
        "type": "array",
        "items": {
            "type": "object",
            "required": ["זמן", "טיפול שניתן"],
            "properties": {
            "זמן": {"type": "string"},
            "טיפול שניתן": {"type": "array", "items": {"type": "string"}}
            }
        }
        },
        "טיפול תרופתי": {
        "type": "array",
        "items": {
            "type": "object",
            "required": ["זמן", "תרופה"],
            "properties": {
            "זמן": {"type": "string"},
            "תרופה": {"type": "array", "items": {"type": "string"}}
            }
        }
        },
        "פינוי": {
        "type": "object",
        "required": ["אופן הפינוי", "יעד הפינוי", "שם בית החולים"],
        "properties": {
            "אופן הפינוי": {"type": "string"},
            "יעד הפינוי": {"type": "string"},
            "שם בית החולים": {"type": "string"},
            "מחלקה": {"type": "string"},
            "שם המקבל ביעד הפינוי": {"type": "string"}
        }
        }
    }

CHATGPT_REQUIREMENTS = f"""
You are a text processor.I will provide you with a Hebrew text and a list of hebrew keywords.
Your task is to extract the values corresponding to these keywords and return a valid JSON object.
hebrew keywords:
{hebrew_keywords}
fill this json object with the values you find in the user input text:
{json_format}
"""


GEMINI_REQUIREMENTS = f"""
You are a text processor.I will provide you with a Hebrew text and a json format.
Your task is to extract the values corresponding to these keywords and return a valid JSON object.
fill this json object with the values you find in the user input text and according to the case codes:
{json_format}
here the case codes:
{case_codes}

text:
"""